app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','R')) ORDER BY release_date
---
  def index
#    @all_ratings = [{'G' => 1,'PG' => 1,'PG-13' => 1,'R' => 1, 'NC-17' => 1}]
    @all_ratings = ['G', 'PG', 'PG-13', 'R', 'NC-17']
    if params[:sort] == nil
      sort = session[:sort]
    else
      sort = params[:sort]
      session[:sort] = sort
    end

    if params[:ratings] == nil
      if session[:ratings] == nil then
        @ratings = @all_ratings
      else
        @ratings = session[:ratings]
      end
    else
      @ratings = params[:ratings].keys()
      session[:ratings] = @ratings
    end

    if sort == nil then
      @movies = Movie.where("rating in (?)", @ratings)